app/views/orders_details/index.html.erb


            <% @order.user_order_joins.each do |order_join|  %>
---
SELECT `user_order_joins`.* FROM `user_order_joins` WHERE `user_order_joins`.`order_id` = 4