app/views/orders/index.html.erb


      <% order.users.each do |userInOrder|%>
---
SELECT `users`.* FROM `users` INNER JOIN `user_order_joins` ON `users`.`id` = `user_order_joins`.`user_id` WHERE `user_order_joins`.`order_id` = 1

      <tr>
        <td><%= order.orderType %></td>
---
SELECT `orders`.* FROM `orders`