app/controllers/friends_controller.rb

	def create

		@parameter = params[:email]

		if  @parameter.empty?
			@error_null = {'value': 'You have to put some data'}
			puts "this guy is empty"
			render json: @error_null
		else

            if User.exists? email: @parameter
                puts "ok fine it is a user"

                if @parameter == current_user.email
                    @error_addSelf = {'same': 'You can not add your self !'}
                    puts "add your self nigger"
                    render json: @error_addSelf
                else

                    @fid = User.find_by(email: params[:email])
                    @user = current_user
                    if @user.friendships.exists? friend_id: @fid.id
                        @error_addExist = {'exist': 'You already added this friend !'}
                        puts "your friend is already here"
                        render json: @error_addExist
                    else
                        puts "it is a new friend gal save"
                        @user = current_user
                        @friend = Friendship.create(user_id: current_user.id, friend_id: @fid.id)
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'test@gmail.com' LIMIT 1
SELECT 1 AS one FROM `users` WHERE `users`.`email` = 'sfafa' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'alaa@gmail.com' LIMIT 1
SELECT 1 AS one FROM `friendships` WHERE `friendships`.`user_id` = 2 AND `friendships`.`friend_id` = 1 LIMIT 1
INSERT INTO `friendships` (`user_id`, `friend_id`, `created_at`, `updated_at`) VALUES (2, 1, '2021-04-19 12:51:58.523622', '2021-04-19 12:51:58.523622')

	def show
		@friend_to_user = User.joins("INNER JOIN friendships ON friendships.friend_id = users.id")
---
SELECT `users`.* FROM `users` INNER JOIN `friendships` ON `users`.`id` = `friendships`.`friend_id` WHERE `friendships`.`user_id` = 5

	def destroy
		@friend = Friendship.find_by(user_id: params[:param1],friend_id: params[:param2])
		@friend.destroy
        @friend_to_user = User.joins("INNER JOIN friendships ON friendships.friend_id = users.id")
---
SELECT `friendships`.* FROM `friendships` WHERE `friendships`.`user_id` = 2 AND `friendships`.`friend_id` = 1 LIMIT 1
DELETE FROM `friendships` WHERE `friendships`.`id` = 1
SELECT `users`.* FROM `users` INNER JOIN `friendships` ON `users`.`id` = `friendships`.`friend_id` WHERE `friendships`.`user_id` = 1