app/controllers/groups_controller.rb

    def new
		@group = current_user.groups
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`user_id` = 1

	def create
        @group_params = params[:name]
		#check if the value is null
		if @group_params.empty?
			@error_null = {'value': 'You have to put some data in group name'}
			render json: @error_null
		else
			#if the name exist
			if Group.exists? name: @group_params
				@error_exist = {'exist': 'This Group Name is already exist , please change the name'}
				render json: @error_exist
			else
				#it is new group
				@user = current_user
				@group = @user.groups.create(name: @group_params )
---
SELECT 1 AS one FROM `groups` WHERE `groups`.`name` = 'hello' LIMIT 1
INSERT INTO `groups` (`name`, `user_id`, `created_at`, `updated_at`) VALUES ('hello', 1, '2021-04-25 23:53:50.382438', '2021-04-25 23:53:50.382438')

	def show
		@group = current_user.groups
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`user_id` = 1

	def destroy
		@group = Group.find(params[:id])
		@group.destroy
		@group = current_user.groups
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 7 LIMIT 1
DELETE FROM `groups` WHERE `groups`.`id` = 7
SELECT `groups`.* FROM `groups` WHERE `groups`.`user_id` = 1

	def getName
		@group = Group.find(params[:id])
		@group_members =[]
		@group.group_members.each do |member|
			@group_members.push(User.find(member.user_id));
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 7 LIMIT 1
SELECT `group_members`.* FROM `group_members` WHERE `group_members`.`group_id` = 7
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1

	def addFriend
		@friendEmail = params[:email]
			#check if it is null
		if @friendEmail.empty?
			@error_null = {'nullValue': 'Please insert some data !'}
			render json: @error_null
		else
			#check if it is wrong type
			if User.exists? email: @friendEmail
			#check if he add himself
			if @friendEmail == current_user.email
				@error_addSelf = {'same': 'You can not add your self !'}
				render json: @error_addSelf
			  else
			#check if the user exist in the group itself before
				@fid = User.find_by(email: params[:email])
				@current_group = Group.find(params[:groupId])
				if @current_group.group_members.exists? user_id: @fid.id
					@error_addExist = {'addExist': 'This user is already assigned to this group !'}
					render json: @error_addExist
				else
					#check if this user in friendship list or not
					@fid = User.find_by(email: params[:email])
					@user = current_user
					if @user.friendships.exists? friend_id: @fid.id
					@fid = User.find_by(email: params[:email])
					@gid = params[:groupId]
					@group = @fid.group_members.create(group_id: @gid)
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'test@gmail.com' LIMIT 1
SELECT 1 AS one FROM `users` WHERE `users`.`email` = 'test@gmail.com' LIMIT 1
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 7 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT 1 AS one FROM `group_members` WHERE `group_members`.`group_id` = 7 AND `group_members`.`user_id` = 3 LIMIT 1
SELECT 1 AS one FROM `friendships` WHERE `friendships`.`user_id` = 1 AND `friendships`.`friend_id` = 3 LIMIT 1
INSERT INTO `group_members` (`group_id`, `user_id`, `created_at`, `updated_at`) VALUES (7, 3, '2021-04-25 23:54:29.177381', '2021-04-25 23:54:29.177381')