app/controllers/home_controller.rb

SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 1 ORDER BY `orders`.`created_at` DESC
---
  def index

  	if current_user
		@orders = Order.all.where(user_id: current_user.id).order(created_at: :desc)