app/controllers/orders_controller.rb

  def create

    @order=Order.new
    @order.orderType=order_params[:orderType]
    @order.user_id=order_params[:user_id]
    @order.orderFrom=order_params[:orderFrom]
    @order.menuImage=order_params[:menuImage]
    @order.status="unfinished";

    @order.save

    @currentUser=User.find(order_params[:user_id])
    @dict  =  { :user =>@currentUser , :order => @order}
      @userOrder=UserOrderJoin.new(@dict)
      @userOrder.save
---
INSERT INTO `orders` (`orderType`, `orderFrom`, `menuImage`, `status`, `user_id`, `created_at`, `updated_at`) VALUES ('Lunch', 'kfc', '#<ActionDispatch::Http::UploadedFile:0x00007f9fe84ceef8>', 'unfinished', 2, '2021-04-19 12:12:35.324220', '2021-04-19 12:12:35.324220')
INSERT INTO `user_order_joins` (`user_id`, `order_id`, `created_at`, `updated_at`) VALUES (2, 3, '2021-04-19 12:12:35.553009', '2021-04-19 12:12:35.553009')