app/controllers/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT `orders`.* FROM `orders`

  def edit
    @order=Order.find(params[:id])
    @order.update(status: 'finished')
    @order.users.each do |user|
      if user.id != @order.user_id
        @msg = current_user.full_name + ' marked his order ' + @order.orderType + ' as finished'
        ActionCable.server.broadcast("notification_channel", { body: @msg, userId: user.id})
        @notificationDict  =  { :body => @msg, :user => user , :notificationType => "order finished",:seen => false}

        @notification = Notification.new(@notificationDict)
        @notification.save
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 2 LIMIT 1
UPDATE `orders` SET `orders`.`status` = 'finished', `orders`.`updated_at` = '2021-04-28 17:40:57.627968' WHERE `orders`.`id` = 2
SELECT `users`.* FROM `users` INNER JOIN `user_order_joins` ON `users`.`id` = `user_order_joins`.`user_id` WHERE `user_order_joins`.`order_id` = 2
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
INSERT INTO `notifications` (`body`, `notificationType`, `seen`, `user_id`, `created_at`, `updated_at`) VALUES ('Ahmed Maher marked his order Breakfast as finished', 'order finished', FALSE, 2, '2021-04-28 17:40:57.853203', '2021-04-28 17:40:57.853203')

  def create

    @order=Order.new
    @order.orderType=order_params[:orderType]
    @order.user_id=order_params[:user_id]
    @order.orderFrom=order_params[:orderFrom]
    @order.menuImage=order_params[:menuImage]
    @order.status="unfinished";
    notValidEmails=[]
    @order.save
    usersToAdd=order_params[:friendsToAdd].split(" ")

    usersToAdd.each do |user|
            @currentFriend=User.find_by(email:user)
      @dict  =  { :user =>@currentFriend , :order => @order}
      @userOrder=UserOrderJoin.new(@dict)
      @userOrder.save
    end
    @currentUser=User.find(order_params[:user_id])
    @dict  =  { :user =>@currentUser , :order => @order}
      @userOrder=UserOrderJoin.new(@dict)
      @userOrder.save
---
SELECT `users`.* FROM `users` INNER JOIN `user_order_joins` ON `users`.`id` = `user_order_joins`.`user_id` WHERE `user_order_joins`.`order_id` = 5
INSERT INTO `orders` (`orderType`, `orderFrom`, `menuImage`, `status`, `user_id`, `created_at`, `updated_at`) VALUES ('Breakfast', 'hello', '#<ActionDispatch::Http::UploadedFile:0x00007f3644d9beb8>', 'unfinished', 1, '2021-04-28 17:41:34.527355', '2021-04-28 17:41:34.527355')
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'test@gmail.com' LIMIT 1
INSERT INTO `orders` (`orderType`, `orderFrom`, `menuImage`, `status`, `user_id`, `created_at`, `updated_at`) VALUES ('Breakfast', 'kfc', '#<ActionDispatch::Http::UploadedFile:0x00007fee20096350>', 'unfinished', 1, '2021-04-28 05:29:37.041199', '2021-04-28 05:29:37.041199')
INSERT INTO `user_order_joins` (`user_id`, `order_id`, `created_at`, `updated_at`) VALUES (2, 3, '2021-04-28 17:41:34.766097', '2021-04-28 17:41:34.766097')
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `user_order_joins` (`user_id`, `order_id`, `created_at`, `updated_at`) VALUES (1, 3, '2021-04-28 17:41:34.939249', '2021-04-28 17:41:34.939249')


    respond_to do |format|
      if @order.save
        @order.users.each do |user|
          if user.id != @order.user_id
            @msg = current_user.full_name + ' add you to his order ' + @order.orderType
---
SELECT `users`.* FROM `users` INNER JOIN `user_order_joins` ON `users`.`id` = `user_order_joins`.`user_id` WHERE `user_order_joins`.`order_id` = 3
SELECT `users`.* FROM `users` INNER JOIN `user_order_joins` ON `users`.`id` = `user_order_joins`.`user_id` WHERE `user_order_joins`.`order_id` = 5

            @notificationDict  =  { :body => @msg, :user => user , :notificationType => "add new order",:seen => false}

            @notification = Notification.new(@notificationDict)
            @notification.save
---
INSERT INTO `notifications` (`body`, `notificationType`, `seen`, `user_id`, `created_at`, `updated_at`) VALUES ('Ahmed Maher add you to his order Breakfast', 'add new order', FALSE, 2, '2021-04-28 17:41:35.712643', '2021-04-28 17:41:35.712643')

  def destroy
    @order.users.each do |user|
      if user.id != @order.user_id
        @msg = current_user.full_name + ' deleted his order ' + @order.orderType
        ActionCable.server.broadcast("notification_channel", { body: @msg, userId: user.id})
        @notificationDict  =  { :body => @msg, :user => user , :notificationType => "order deleted",:seen => false}

        @notification = Notification.new(@notificationDict)
        @notification.save
      end
    end
    @order.destroy
---
SELECT `users`.* FROM `users` INNER JOIN `user_order_joins` ON `users`.`id` = `user_order_joins`.`user_id` WHERE `user_order_joins`.`order_id` = 4
INSERT INTO `notifications` (`body`, `notificationType`, `seen`, `user_id`, `created_at`, `updated_at`) VALUES ('Ahmed Maher deleted his order Breakfast', 'order deleted', FALSE, 2, '2021-04-28 17:45:26.096068', '2021-04-28 17:45:26.096068')
DELETE FROM `orders` WHERE `orders`.`id` = 4

  def set_order
      @order = Order.find(params[:id])
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 2 LIMIT 1