app/controllers/order_members_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'test@gmail.com' LIMIT 1
SELECT 1 AS one FROM `groups` WHERE `groups`.`name` = 'hello' AND `groups`.`user_id` = 1 LIMIT 1
SELECT `groups`.* FROM `groups` WHERE `groups`.`name` = 'hello' AND `groups`.`user_id` = 1
SELECT `users`.* FROM `users` INNER JOIN `group_members` ON `users`.`id` = `group_members`.`user_id` WHERE `group_members`.`group_id` = 7
---
  def create
   if params[:email][0]=="#"
    @groupName=params[:email][1..params[:email].length()]

    if Group.where(name: @groupName,user_id:current_user.id).any?

      @usersInGroup=Group.where(name: @groupName,user_id:current_user.id)[0].users
      ActionCable.server.broadcast("notification_channel", {header: "validate email", body: "group valid" , userId: current_user.id ,groupName: @usersInGroup})
      @usersInGroup.each do |user|

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'test@gmail.com' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `friendships`.* FROM `friendships` WHERE `friendships`.`user_id` = 1 AND `friendships`.`friend_id` = 2
---
  def validateEmail(email)
    if !email.match(/^[a-z]+[0-9\._a-z]+@[a-z]+\.com$/)
      ActionCable.server.broadcast("notification_channel", {header: "validate email", body: "email is not valid" , userId: current_user.id})

    elsif User.where(email: email).take!= nil && User.where(email: email).take.id ==current_user.id
      ActionCable.server.broadcast("notification_channel", {header: "validate email", body: "you can't add yourself" , userId: current_user.id})

    else
      @my_friend_user = User.find_by(email:email)
      @user = User.find(current_user.id)
      @existed_friend  = Friendship.where(user_id: @user,friend_id: @my_friend_user)