app/controllers/orders_details_controller.rb

SELECT `user_order_joins`.* FROM `user_order_joins` WHERE `user_order_joins`.`order_id` = 4
SELECT `user_order_joins`.`user_id` FROM `user_order_joins` WHERE `user_order_joins`.`order_id` = 4
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 4 LIMIT 1
---
  def index
    @orderJoins = UserOrderJoin.where(order_id: params[:order_id])
    if @orderJoins.pluck(:user_id).include? current_user.id
      @order_id = params[:order_id]
      @order = Order.find(params[:order_id])

INSERT INTO `order_details` (`item_name`, `amount`, `price`, `comment`, `user_order_join_id`, `created_at`, `updated_at`) VALUES ('test', 5, 20.0, '', 4, '2021-04-28 04:59:48.399415', '2021-04-28 04:59:48.399415')
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 4 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 3 LIMIT 1
SELECT `user_order_joins`.* FROM `user_order_joins` WHERE `user_order_joins`.`order_id` = 4
---
  def create
    @order_users=[]
    @newItem = OrderDetail.new(details_params)
    if @newItem.save
      @order = Order.find(params[:order_id])
      @order.user_order_joins.each do |order_join|

SELECT `user_order_joins`.* FROM `user_order_joins` WHERE `user_order_joins`.`order_id` = 4 AND `user_order_joins`.`user_id` = 1 LIMIT 1
---
  def details_params
    @joinsId = UserOrderJoin.where(order_id: params[:order_id],user_id: current_user.id).take.id