app/models/user.rb

INSERT INTO `users` (`full_name`, `email`, `encrypted_password`, `created_at`, `updated_at`, `provider`, `uid`, `image`) VALUES ('Mohamed Houssien', 'mohamed24houssien@gmail.com', '$2a$12$4g.D8STpDRTaYjQ582M8MO4hqT43099h8nNb6UMiAMkNy78xKMlka', '2021-04-28 16:28:11.952447', '2021-04-28 16:28:11.952447', 'google_oauth2', '114589682445273144694', 'https://lh3.googleusercontent.com/a/AATXAJyg-0CActefZmLS38mzXilBNbTKuRu1QQKO8Nci=s96-c')
SELECT `users`.* FROM `users` WHERE `users`.`provider` = 'google_oauth2' AND `users`.`uid` = '113064315613782928981' ORDER BY `users`.`id` ASC LIMIT 1
---
  def self.create_from_provider_data(provider_data)
    where(provider: provider_data.provider, uid: provider_data.uid).first_or_create do |user|