app/controllers/users/omniauth_callbacks_controller.rb

INSERT INTO `users` (`full_name`, `email`, `encrypted_password`, `created_at`, `updated_at`, `provider`, `uid`) VALUES ('noura98houssien@gmail.com', 'noura98houssien@gmail.com', '$2a$12$F8LE6x.FetGPW8R0YP4Cj.8cBY7/ICIvHoL8OlgdFflqOo.Xw1ZLm', '2021-04-28 09:58:45.273851', '2021-04-28 09:58:45.273851', 'facebook', '1181831935610417')
---
      def facebook
      @user = User.create_from_provider_data(request.env['omniauth.auth'])

INSERT INTO `users` (`full_name`, `email`, `encrypted_password`, `created_at`, `updated_at`, `provider`, `uid`, `image`) VALUES ('Ahmed-Maher164', 'ahmed164maher@gmail.com', '$2a$12$SaPXX/VwtqLi/53BK.MIA.fhYmG3nzhc8VDS/WopK6/FY4WRpMIR.', '2021-04-28 18:28:16.450495', '2021-04-28 18:28:16.450495', 'github', '76239505', 'https://avatars.githubusercontent.com/u/76239505?v=4')
---
      def github
      @user = User.create_from_provider_data(request.env['omniauth.auth'])

INSERT INTO `users` (`full_name`, `email`, `encrypted_password`, `created_at`, `updated_at`, `provider`, `uid`, `image`) VALUES ('Mohamed Houssien', 'mohamed24houssien@gmail.com', '$2a$12$4g.D8STpDRTaYjQ582M8MO4hqT43099h8nNb6UMiAMkNy78xKMlka', '2021-04-28 16:28:11.952447', '2021-04-28 16:28:11.952447', 'google_oauth2', '114589682445273144694', 'https://lh3.googleusercontent.com/a/AATXAJyg-0CActefZmLS38mzXilBNbTKuRu1QQKO8Nci=s96-c')
---
      def google_oauth2
      @user = User.create_from_provider_data(request.env['omniauth.auth'])